// 演算子
void operators()
{
	// 算術演算子
	1 + 1;
	1 - 1;
	1 * 1;
	10 / 4; // = 2 (整数のみの除算)
	10.0 / 4; // = 2.5
	10 % 4; // = 2 (余り)

	// 比較演算子
	10 < 10;  // false
	10 <= 10; // true
	10 > 10;  // false
	10 >= 10; // true
	10 == 10; // true
	10 != 10; // false

	// 論理演算子
	!true; // false
	true && false; // false
	true || false; // true

	// ビット演算子
	~0x01; // = 0xf7
	0x01 << 1; // = 0x02
	0x01 >> 1; // = 0x00 算術シフト
	0xff & 0x01; // = 0x01 論理積
	0xff | 0x01; // = 0xff 論理和
	0xff ^ 0x01; // = 0xf7 排他的論理和

	// 代入演算子・複合代入演算子
	int a;
	a = 10;
	a += 1;
	a -= 1;
	a *= 10;
	a /= 10;
	a %= 4;
	a <<= 1;
	a >>= 1; // 算術シフト
	a &= 0x01;
	a |= 0x01;
	a ^= 0x01;

	// インクリメント・デクリメント
	int b = 1, c = 1, d = 1, e = 1;
	a = b++; // a = 1, b = 2
	a = ++c; // a = 2, c = 2
	a = d--; // a = 1, d = 0
	a = --e; // a = 0, e = 0

	// 条件演算子
	b ? true : false;
}
